conorpp/u2f-zero/firmware/lib/efm8_usb/src/efm8_usbdep.c
/**************************************************************************//**
 * Copyright (c) 2015 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#include "si_toolchain.h"
#include "efm8_usb.h"
#include <stdint.h>
#include <endian.h>

extern SI_SEGMENT_VARIABLE(myUsbDevice, USBD_Device_TypeDef, MEM_MODEL_SEG);

// -----------------------------------------------------------------------------
// Function Prototypes

// -------------------------------
// Memory-specific FIFO access functions
#ifdef SI_GPTR

static void USB_ReadFIFO_Idata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_IDATA), uint8_t fifoNum);
static void USB_WriteFIFO_Idata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_IDATA));

static void USB_ReadFIFO_Xdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_XDATA), uint8_t fifoNum);
static void USB_WriteFIFO_Xdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_XDATA));

#if SI_GPTR_MTYPE_PDATA != SI_GPTR_MTYPE_XDATA
static void USB_ReadFIFO_Pdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_PDATA), uint8_t fifoNum);
static void USB_WriteFIFO_Pdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_PDATA));
#endif

#if SI_GPTR_MTYPE_DATA != SI_GPTR_MTYPE_IDATA
static void USB_ReadFIFO_Data(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_DATA), uint8_t fifoNum);
static void USB_WriteFIFO_Data(uint8_t numBytes, uint8_t SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_DATA));
#endif

static void USB_WriteFIFO_Code(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_CODE));

#else

// -------------------------------
// Generic FIFO access functions
static void USB_ReadFIFO_Generic(uint8_t numBytes, uint8_t *dat, uint8_t fifoNum);
static void USB_WriteFIFO_Generic(uint8_t numBytes, uint8_t *dat);

#endif  // #ifdef SI_GPTR

// -----------------------------------------------------------------------------
// Functions

/***************************************************************************//**
 * @brief       Reads Isochronous data from the Endpoint FIFO
 * @param       fifoNum
 *              USB Endpoint FIFO to read
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to buffer to hold data read from the FIFO
 ******************************************************************************/
#if (SLAB_USB_EP3OUT_USED && (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_ISOC) && (SLAB_USB_EP3OUT_MAX_PACKET_SIZE > 255))
// ----------------------------------------------------------------------------
// If Isochronous mode is enabled and the max packet size is greater than 255,
// break the FIFO reads up into multiple reads of 255 or less bytes.
// ----------------------------------------------------------------------------
void USB_ReadFIFOIso(uint8_t fifoNum, uint16_t numBytes, uint8_t *dat)
{
  uint8_t numBytesRead;

  // USB_ReadFIFO() accepts a maximum of 255 bytes. If the number of bytes to
  // send is greated than 255, call USB_ReadFIFO() multiple times.
  while (numBytes > 0)
  {
    numBytesRead = (numBytes > 255) ? 255 : numBytes;
    USB_ReadFIFO(fifoNum, numBytesRead, dat);
    numBytes -= numBytesRead;
    dat += numBytesRead;
  }
}
#else
#define USB_ReadFIFOIso(a, b, c) USB_ReadFIFO(a, b, c)
#endif

/***************************************************************************//**
 * @brief       Writes Isochronous data to the Endpoint FIFO
 * @param       fifoNum
 *              USB Endpoint FIFO to write
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to buffer hoding data to write to the FIFO
 ******************************************************************************/
#if (SLAB_USB_EP3IN_USED && (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_ISOC) && (SLAB_USB_EP3IN_MAX_PACKET_SIZE > 255))
// ----------------------------------------------------------------------------
// If Isochronous mode is enabled and the max packet size is greater than 255,
// break the FIFO writes up into multiple writes of 255 or less bytes.
// ----------------------------------------------------------------------------
void USB_WriteFIFOIso(uint8_t fifoNum, uint16_t numBytes, uint8_t *dat)
{
  uint8_t numBytesWrite;

  // USB_WriteFIFO() accepts a maximum of 255 bytes. If the number of bytes to
  // send is greated than 255, call USB_WriteFIFO() multiple times.
  while (numBytes > 0)
  {
    numBytesWrite = (numBytes > 255) ? 255 : numBytes;
    numBytes -= numBytesWrite;
    USB_WriteFIFO(fifoNum, numBytesWrite, dat, (numBytes == 0));
    dat += numBytesWrite;
  }
}
#else
#define USB_WriteFIFOIso(a, b, c) USB_WriteFIFO(a, b, c, true)
#endif

#if SLAB_USB_EP1IN_USED
/***************************************************************************//**
 * @brief       Handle Endpoint 1 IN transfer interrupt
 * @note        This function takes no parameters, but it uses the EP1IN status
 *              variables stored in @ref myUsbDevice.ep1in.
 ******************************************************************************/
void handleUsbIn1Int(void)
{
  uint8_t xferred;
  bool callback;

  USB_SetIndex(1);

  if (USB_EpnInGetSentStall())
  {
    USB_EpnInClearSentStall();
  }
  else if (myUsbDevice.ep1in.state == D_EP_TRANSMITTING)
  {
    xferred = (myUsbDevice.ep1in.remaining > SLAB_USB_EP1IN_MAX_PACKET_SIZE)
              ? SLAB_USB_EP1IN_MAX_PACKET_SIZE : myUsbDevice.ep1in.remaining;
    myUsbDevice.ep1in.remaining -= xferred;
    myUsbDevice.ep1in.buf += xferred;

    callback = myUsbDevice.ep1in.misc.bits.callback;

    // Load more data
    if (myUsbDevice.ep1in.remaining > 0)
    {
      USB_WriteFIFO(1,
                    (myUsbDevice.ep1in.remaining > SLAB_USB_EP1IN_MAX_PACKET_SIZE)
                      ? SLAB_USB_EP1IN_MAX_PACKET_SIZE
                      : myUsbDevice.ep1in.remaining,
                    myUsbDevice.ep1in.buf,
                    true);
    }
    else
    {
      myUsbDevice.ep1in.misc.bits.callback = false;
      myUsbDevice.ep1in.state = D_EP_IDLE;
    }

    if (callback == true)
    {
      USBD_XferCompleteCb(EP1IN, USB_STATUS_OK, xferred, myUsbDevice.ep1in.remaining);
    }

