conorpp/u2f-zero/firmware/lib/efm8_usb/src/efm8_usbdep.c
#if  ((SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_BULK) || (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_INTR))
      USBD_XferCompleteCb(EP3OUT, status, count, myUsbDevice.ep3out.remaining);
#elif (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_ISOC)

      // In Isochronous mode, the meaning of the USBD_XferCompleteCb parameters changes:
      //   xferred is the number of bytes received in the last packet
      //   remaining is the current index into the circular buffer
      USBD_XferCompleteCb(EP3OUT, status, count, myUsbDevice.ep3outIsoIdx);
#endif
    }
  }
}
#endif  // EP3OUT_USED

/***************************************************************************//**
 * @brief       Reads data from the USB FIFO
 * @param       fifoNum
 *              USB Endpoint FIFO to read
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to buffer to hold data read from the FIFO
 ******************************************************************************/
void USB_ReadFIFO(uint8_t fifoNum, uint8_t numBytes, uint8_t *dat)
{
  if (numBytes > 0)
  {
    USB_EnableReadFIFO(fifoNum);

    // Convert generic pointer to memory-specific pointer and call the
    // the corresponding memory-specific function, if possible.
    // The memory-specific functions are much faster than the generic functions.
#ifdef SI_GPTR

    switch (((SI_GEN_PTR_t *)&dat)->gptr.memtype)
    {
      case SI_GPTR_MTYPE_IDATA:
        USB_ReadFIFO_Idata(numBytes, dat, fifoNum);
        break;

      // For some compilers, IDATA and DATA are treated the same.
      // Only call the USB_ReadFIFO_Data() if the compiler differentiates
      // between DATA and IDATA.
#if (SI_GPTR_MTYPE_DATA != SI_GPTR_MTYPE_IDATA)
      case SI_GPTR_MTYPE_DATA:
        USB_ReadFIFO_Data(numBytes, dat, fifoNum);
        break;
#endif

      case SI_GPTR_MTYPE_XDATA:
        USB_ReadFIFO_Xdata(numBytes, dat, fifoNum);
        break;

      // For some compilers, XDATA and PDATA are treated the same.
      // Only call the USB_ReadFIFO_Pdata() if the compiler differentiates
      // between XDATA and PDATA.
#if (SI_GPTR_MTYPE_PDATA != SI_GPTR_MTYPE_XDATA)
      case SI_GPTR_MTYPE_PDATA:
        USB_ReadFIFO_Pdata(numBytes, dat, fifoNum);
        break;
#endif

      default:
        break;
    }

#else
    USB_ReadFIFO_Generic(numBytes, dat, fifoNum);
#endif  // #ifdef SI_GPTR

    USB_DisableReadFIFO(fifoNum);
  }
}

/***************************************************************************//**
 * @brief       Writes data to the USB FIFO
 * @param       fifoNum
 *              USB Endpoint FIFO to write
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to buffer hoding data to write to the FIFO
 * @param       txPacket
 *              If TRUE, the packet will be sent immediately after loading the
 *              FIFO
 *              If FALSE, the packet will be stored in the FIFO and the
 *              transmission must be started at a later time
 ******************************************************************************/
void USB_WriteFIFO(uint8_t fifoNum, uint8_t numBytes, uint8_t *dat, bool txPacket)
{
  USB_EnableWriteFIFO(fifoNum);

  // Convert generic pointer to memory-specific pointer and call the
  // the corresponding memory-specific function, if possible.
  // The memory-specific functions are much faster than the generic functions.
#ifdef SI_GPTR

  switch (((SI_GEN_PTR_t *)&dat)->gptr.memtype)
  {
    case SI_GPTR_MTYPE_IDATA:
      USB_WriteFIFO_Idata(numBytes, dat);
      break;

    // For some compilers, IDATA and DATA are treated the same.
    // Only call the USB_WriteFIFO_Data() if the compiler differentiates between
    // DATA and IDATA.
#if (SI_GPTR_MTYPE_DATA != SI_GPTR_MTYPE_IDATA)
    case SI_GPTR_MTYPE_DATA:
      USB_WriteFIFO_Data(numBytes, dat);
      break;
#endif

    case SI_GPTR_MTYPE_XDATA:
      USB_WriteFIFO_Xdata(numBytes, dat);
      break;

    // For some compilers, XDATA and PDATA are treated the same.
    // Only call the USB_WriteFIFO_Pdata() if the compiler differentiates
    // between XDATA and PDATA.
#if (SI_GPTR_MTYPE_PDATA != SI_GPTR_MTYPE_XDATA)
    case SI_GPTR_MTYPE_PDATA:
      USB_WriteFIFO_Pdata(numBytes, dat);
      break;
#endif

    case SI_GPTR_MTYPE_CODE:
      USB_WriteFIFO_Code(numBytes, dat);
      break;

    default:
      break;
  }

#else
  USB_WriteFIFO_Generic(numBytes, dat);
#endif  // #ifdef SI_GPTR

  USB_DisableWriteFIFO(fifoNum);

  if ((txPacket == true) && (fifoNum > 0))
  {
    USB_SetIndex(fifoNum);
    USB_EpnSetInPacketReady();
  }
}

// -----------------------------------------------------------------------------
// Memory-Specific FIFO Access Functions
//
// Memory-specific functions are much faster (more than 2x) than generic
// generic functions, so we will use memory-specific functions if possible.
// -----------------------------------------------------------------------------

#ifdef SI_GPTR
/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in IRAM
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to IDATA buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
static void USB_ReadFIFO_Idata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_IDATA), uint8_t fifoNum)
{
  while (--numBytes)
  {
    USB_GetFIFOByte(*dat);
    dat++;
  }
  USB_GetLastFIFOByte(*dat, fifoNum);
}

/***************************************************************************//**
 * @brief       Writes data held in IRAM to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to IDATA buffer holding data to write to the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Idata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_IDATA))
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}

/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in XRAM
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to XDATA buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
static void USB_ReadFIFO_Xdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_XDATA), uint8_t fifoNum)
{
  while (--numBytes)
  {
    USB_GetFIFOByte(*dat);
    dat++;
  }
  USB_GetLastFIFOByte(*dat, fifoNum);
}

/***************************************************************************//**
 * @brief       Writes data held in XRAM to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to XDATA buffer holding data to write to the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Xdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_XDATA))
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}

#if SI_GPTR_MTYPE_PDATA != SI_GPTR_MTYPE_XDATA
/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in paged XRAM
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to PDATA buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
static void USB_ReadFIFO_Pdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_PDATA), uint8_t fifoNum)
{
  while (--numBytes)
  {
    USB_GetFIFOByte(*dat);
    dat++;
  }
  USB_GetLastFIFOByte(*dat, fifoNum);
}

/***************************************************************************//**
 * @brief       Writes data held in paged XRAM to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to PDATA buffer holding data to write to the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Pdata(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_PDATA))
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}

#endif

#if SI_GPTR_MTYPE_DATA != SI_GPTR_MTYPE_IDATA
/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in DRAM
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to DATA buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
static void USB_ReadFIFO_Data(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_DATA), uint8_t fifoNum)
{
  while (--numBytes)
  {
    USB_GetFIFOByte(*dat);
    dat++;
  }
  USB_GetLastFIFOByte(*dat, fifoNum);
}

/***************************************************************************//**
 * @brief       Writes data held in DRAM to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to DATA buffer to hold data read from the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Data(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_DATA))
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}
#endif

/***************************************************************************//**
 * @brief       Writes data held in code space to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to CODE buffer holding data to write to the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Code(uint8_t numBytes, SI_VARIABLE_SEGMENT_POINTER(dat, uint8_t, SI_SEG_CODE))
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}

#else
/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in generic memory space
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to generic buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
static void USB_ReadFIFO_Generic(uint8_t numBytes, uint8_t *dat, uint8_t fifoNum)
{
  while (--numBytes)
  {
    USB_GetFIFOByte(*dat);
    dat++;
  }
  USB_GetLastFIFOByte(*dat, fifoNum);
}

/***************************************************************************//**
 * @brief       Writes data held in generic memory space to the USB FIFO
 * @details     The FIFO to write must be set before calling the function with
 *              @ref USB_EnableWriteFIFO().
 * @param       numBytes
 *              Number of bytes to write to the FIFO
 * @param       dat
 *              Pointer to generic buffer holding data to write to the FIFO
 ******************************************************************************/
static void USB_WriteFIFO_Generic(uint8_t numBytes, uint8_t *dat)
{
  while (numBytes--)
  {
    USB_SetFIFOByte(*dat);
    dat++;
  }
}

#endif  // #ifdef SI_GPTR
